In [2]:
import requests

import pandas as pd

from bs4 import BeautifulSoup

In [3]:
URL = 'https://practicum-content.s3.us-west-1.amazonaws.com/data-analyst-eng/moved_chicago_weather_2017.html'

In [4]:
req = requests.get(URL)

In [5]:
soup = BeautifulSoup(req.text, 'lxml')

In [6]:
table = soup.find('table', attrs={"id": "weather_records"})

In [7]:
headers = [header.text for header in table.find_all('th')]

In [8]:
rows = []
for row in table.find_all('tr'):
    cells = row.find_all('td')
    if len(cells) > 0:
        rows.append([cell.text for cell in cells])

weather_records = pd.DataFrame(rows, columns=headers)

In [11]:
weather_records = pd.DataFrame(rows, columns=headers)

weather_records.head()

         Date and time Temperature       Description
0  2017-11-01 00:00:00     276.150     broken clouds
1  2017-11-01 01:00:00     275.700  scattered clouds
2  2017-11-01 02:00:00     275.610   overcast clouds
3  2017-11-01 03:00:00     275.350     broken clouds
4  2017-11-01 04:00:00     275.240     broken clouds

In [12]:
weather_records.shape

(697, 3)

In [16]:
company_df = pd.read_csv('moved_project_sql_result_01.csv')

company_df.head()

                      company_name  trips_amount
0                        Flash Cab         19558
1        Taxi Affiliation Services         11422
2                 Medallion Leasin         10367
3                       Yellow Cab          9888
4  Taxi Affiliation Service Yellow          9299

In [17]:
neighborhood_df = pd.read_csv('moved_project_sql_result_04.csv')

neighborhood_df.head()

  dropoff_location_name  average_trips
0                  Loop   10727.466667
1           River North    9523.666667
2         Streeterville    6664.666667
3             West Loop    5163.666667
4                O'Hare    2546.900000